1s/ERP/extensions/liko/Documents/Лико_КорректировкаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_КорректировкаЗатрат</Name>
		</Properties>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/Лико_ТипСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ТипСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СИМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/Лико_ПередачаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ПередачаТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаБрака</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧленКомиссии3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧленКомиссии1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧленКомиссии2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаИсходящегоДокументаСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПодтвержденОтделомЗакупок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОпераций_ПередачаСоСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БракПодтвержденПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерИсходящегоДокументаСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаФормированияАктаБрака</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаИсходящегоДокументаСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказВПереработку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПереработчику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаявкаНаСклад</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БракМатериала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РаспоряжениеИнтеркампани</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДавальцу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВнутренняяПереработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВнутренняяПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонвертПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Конверты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АдресХраненияНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Секция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТС_СекцииРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Конверт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Конверты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КонвертПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Конверты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦеныНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/Лико_КорректировкаЗатрат/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&Вместо("ЗаполнитьЗатратыНаСервере")
Процедура Лико_ЗаполнитьЗатратыНаСервере()
	Объект.Затраты.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
    "ВЫБРАТЬ
	|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа КАК ЦеноваяГруппа
	|ПОМЕСТИТЬ ВТИсключений
	|ИЗ
	|	Справочник.ЦеновыеГруппы.БазаРасчетаЦены КАК ЦеновыеГруппыБазаРасчетаЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеновыеГруппыБазаРасчетаЦены.ЦеноваяГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеновыеГруппыБазаРасчетаЦены.Ссылка
	|ИЗ
	|	Справочник.ЦеновыеГруппы.БазаРасчетаЦены КАК ЦеновыеГруппыБазаРасчетаЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеновыеГруппыБазаРасчетаЦены.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	СУММА(СебестоимостьТоваровОбороты.СтоимостьБезНДСРасход + СебестоимостьТоваровОбороты.ДопРасходыБезНДСРасход) КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов > 0
	|				ТОГДА СебестоимостьТоваровОбороты.КоличествоРасход / СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.КоэффициентЕдиницыДляОтчетов
	|			ИНАЧЕ СебестоимостьТоваровОбороты.КоличествоРасход
	|		КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ ВТСклад
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Организация = &Площадка
	|				И АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа <> ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
	|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры.Лико_РулонныйМатериал
	|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа.Лико_РасчетКакОсновнойКраски
	|				И НЕ АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа В
	|						(ВЫБРАТЬ
	|							ВТИсключений.ЦеноваяГруппа КАК ЦеноваяГруппа
	|						ИЗ
	|							ВТИсключений КАК ВТИсключений)
	|				И АналитикаУчетаНоменклатуры.СкладскаяТерритория.Лико_ТипСклада <> ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.ГП)) КАК СебестоимостьТоваровОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|		ПО СебестоимостьТоваровОбороты.Регистратор = Лико_ПередачаТоваров.Распоряжение
	|			И (Лико_ПередачаТоваров.БракМатериала = ИСТИНА)
	|ГДЕ
	|	(СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ВнутреннееПотребление
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|			ИЛИ СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров)
	|	И ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
	|				ТОГДА СебестоимостьТоваровОбороты.Регистратор.СкладПолучатель.ЦеховаяКладовая
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Лико_ПередачаТоваров.Ссылка ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА СебестоимостьТоваровОбороты.Регистратор ССЫЛКА Документ.СборкаТоваров
	|				ТОГДА СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура <> СебестоимостьТоваровОбороты.Регистратор.Номенклатура
	|						И НЕ СебестоимостьТоваровОбороты.Регистратор.Лико_Документ ССЫЛКА Документ.ЛикоРаспределениеРасходовПоЭтапам
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ЦеноваяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСклад.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВТСклад.Стоимость КАК Стоимость,
	|	ВТСклад.Количество КАК Количество,
	|	ВТСклад.Стоимость / ВТСклад.Количество КАК ЦенаФакт
	|ПОМЕСТИТЬ ВТФакт
	|ИЗ
	|	ВТСклад КАК ВТСклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТФакт.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВТФакт.Стоимость КАК Стоимость,
	|	ВТФакт.Количество КАК Количество,
	|	ВТФакт.ЦенаФакт КАК ЦенаФакт,
	|	СУММА(ЕСТЬNULL(Лико_ЗатратыПоЗаказуОбороты.КоличествоПланОборот, 0)) КАК КоличествоПлан
	|ПОМЕСТИТЬ ВТРасчет
	|ИЗ
	|	ВТФакт КАК ВТФакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
	|				&ДатаНачала,
	|				&ДатаОкончания,
	|				,
	|				ЗаказКлиента.Площадка.Организация = &Площадка
	|					И НЕ ДавальческоеСырье) КАК Лико_ЗатратыПоЗаказуОбороты
	|		ПО (ВТФакт.ЦеноваяГруппа = Лико_ЗатратыПоЗаказуОбороты.Затрата
	|				ИЛИ ВТФакт.ЦеноваяГруппа = Лико_ЗатратыПоЗаказуОбороты.Затрата.ЦеноваяГруппа)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТФакт.ЦенаФакт,
	|	ВТФакт.Стоимость,
	|	ВТФакт.Количество,
	|	ВТФакт.ЦеноваяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасчет.ЦеноваяГруппа.Код КАК КодЦг,
	|	ВТРасчет.ЦеноваяГруппа КАК Затрата,
	|	ВТРасчет.Стоимость КАК Стоимость,
	|	ВТРасчет.Количество КАК Количество,
	|	ЕСТЬNULL(ВТРасчет.КоличествоПлан, 0) КАК КоличествоПлан,
	|	ВТРасчет.ЦенаФакт КАК ЦенаФакт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТРасчет.КоличествоПлан, 0) > 0
	|			ТОГДА ВТРасчет.Стоимость / ВТРасчет.КоличествоПлан
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаТабашФакт
	|ИЗ
	|	ВТРасчет КАК ВТРасчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодЦг";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Площадка", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = Объект.Затраты.добавить();
		заполнитьзначенияСвойств(стр, выборка);
	КонецЦикла;

КонецПроцедуры
